#include <iostream>
#include <algorithm>

const int ROWS = 3;
const int COLS = 6;

int main()
{
    // 2D array
    int multi[ROWS][COLS] = {{0, 1, 2, 3, 4, 5},
                             {10, 11, 12, 13, 14, 15},
                             {100, 101, 102, 103, 104, 105}};

    int arr[] = {5, 5, 5};
    std::cout << *(multi + 1) << "\n\n";

    // Елементите отново са наредени последователно в паметта;
    // Едно изместване във външния масив е еквивалентно на
    // (колкото са елементите във всеки от подмасивите му) на брой измествания от първия елемент.
    std::cout << multi[1][2] << "\n";
    std::cout << multi[0][7] << "\n";
    std::cout << *(*(multi + 1) + 2) << "\n\n";

    // Всеки елемент на масива е масив (или по-скоро адреса към първия му елемент)
    std::cout << multi[2] << "\n";
    std::cout << *(multi + 2) << "\n\n";

    // Каква е разликата?
    std::cout << *( (multi + 1) + 1) << "\n";
    std::cout << *(*(multi + 1) + 1) << "\n\n";

}
